<?php

$string['check'] = 'Проверить';
$string['checked'] = 'Проверено';
$string['checkerrorcode'] = 'Запрос завершился с HTTP-кодом {$a}';
$string['checkfailed'] = 'Проверка не удалась';
$string['checkscript'] = 'Скрипт проверки';
$string['correctanswer'] = 'Правильный ответ';
$string['createdbscript'] = 'Скрипт создания БД';
$string['dbdescription'] = 'Описание базы данных';
$string['dbname'] = 'Имя базы данных';
$string['dbms'] = 'СУБД';
$string['dbmsfull'] = 'Система управления базами данных';
$string['enabled'] = 'SQL Judge';
$string['enabled_help'] = 'Автоматически оценивать представленный SQL-код, тестируя его на соответствие заранее определенному поведению.';
$string['hint'] = 'Подсказка';
$string['hinthelp'] = 'Может помочь студентам при неправильном ответе';
$string['maxtime'] = 'Максимальное время';
$string['maxtimehelp'] = 'Максимальное время выполнения скрипта по умолчанию для всех заданий на сайте';
$string['mustcontain'] = 'Запрещенные или требуемые ключевые слова/фразы';
$string['mustcontainhelp'] = 'Одна фраза на строку\nСтроки с запрещенными фразами должны начинаться с !\nКомментарии начинаются с #';
$string['output'] = 'Результаты системы оценки';
$string['pluginname'] = 'SQL Judge';
$string['status'] = 'Статус';
$string['status_help'] = 'Статус указывает на результаты, полученные SQL Judge. Значения перечислены ниже:

- В ожидании: ответ не был проверен или проверяется в настоящее время
- Принято: ответ был проверен и является правильным
- Неверный ответ: ответ был проверен и не является правильным
- Содержание запрещенных или требуемых ключевых слов/фраз: преподаватель установил ключевые слова/фразы, которые должны или не должны появляться в ответе, и Ваш нарушает это правило
- Содержит запрещенные функции: ответ содержит потенциально опасные функции и не может быть проверен
- Превышено время выполнения: Ваш скрипт работал дольше максимально допустимого времени
- Неизвестная ошибка: любая другая ошибка, которая не подходит под упомянутые выше, пожалуйста, свяжитесь с преподавателем';
$string['testdb'] = 'Тестовая база данных';
$string['testdbhelp'] = 'База данных для проверки ответов';
$string['testedon'] = 'Дата проверки';
$string['timelimit'] = 'Ограничение по времени';


